{
    "general": {
        "url": "http://resume.nickistre.net",
        "url_text": "http://resume.nickistre.net",
        "source_url": "https://github.com/nickistre/resume",
        "source_url_text": "GitHub"
    },
    "personal": {
        "name": "Nicholas Istre",
        "address": {
            "address": [
                "321 Gerald Dr."
                ],
            "city": "Lafayette",
            "state": "LA",
            "postal": "70503",
            "country": "USA"
        },
        "contacts": [
            "262-204-7873",
            "nickistre@gmail.com",
            "jobs@nickistre.net"
        ]
    },

    "summary": "I am a programmer with a wide breadth of experience in server, network, and database administration. I look forward to learning and working with new technology to help customers to meet and exceed their needs.",

    "skills": [
        {
            "domain": "Programming Languages",
            "skills": [
                {
                    "skill": "PHP",
                    "subskills": [
                        "Zend Framework 1",
                        "Doctrine 2",
                        "Drupal",
                        "Wordpress",
                        "Joomla",
                        "Horde",
                        "composer"
                    ]
                },
                {
                    "skill": "HTML5, Javascript, & CSS3",
                    "subskills": [
                        "jQuery",
                        "Ext JS",
                        "Sencha Touch",
                        "PhoneGap/Cordova",
                        "Bootstrap",
                        "Node.js",
                        "grunt",
                        "bower"
                    ]
                },
                {
                    "skill": "Python"
                },
                {
                    "skill": "BASH"
                },
                {
                    "skill": "C/C++",
                    "subskills": [
                        "Arduino"
                    ]
                },
                {
                    "skill": "ActionScript",
                    "subskills": [
                        "Flash/Flex",
                        "Air Mobile"
                    ]
                },
                {
                    "skill": "Visual Basic"
                }
            ]
        },
        {
            "domain": "Version Control",
            "skills": [
                {
                    "skill": "Mercurial"
                },
                {
                    "skill": "Git"
                },
                {
                    "skill": "Subversion"
                }
            ]
        },
        {
            "domain": "Web Servers",
            "skills": [
                {
                    "skill": "Apache",
                    "subskills": [
                        "VirtualHosts",
                        "SSL"
                    ]
                },
                {
                    "skill": "nginx",
                    "subskills": [
                        "SSL Reverse Proxy"
                    ]
                }
            ]
        },
        {
            "domain": "Databases",
            "skills": [
                {
                    "skill": "PostgreSQL"
                },
                {
                    "skill": "MySQL"
                },
                {
                    "skill": "CouchDB"
                },
                {
                    "skill": "SQL Server"
                },
                {
                    "skill": "Pervasive.SQL"
                }
            ]
        },
        {
            "domain": "Linux Distributions",
            "skills": [
                {
                    "skill": "Ubuntu"
                },
                {
                    "skill": "Debian"
                },
                {
                    "skill": "CentOS"
                }
            ]
        },
        {
            "domain": "Cloud Services & Virtualization",
            "skills": [
                {
                    "skill": "Amazon AWS"
                },
                {
                    "skill": "VirtualBox",
                    "subskills": [
                        "Vagrant"
                    ]
                },
                {
                    "skill": "VMWare"
                },
                {
                    "skill": "Docker"
                }
            ]
        },
        {
            "domain": "Other Technologies",
            "skills": [
                {
                    "skill": "Email Servers",
                    "subskills": [
                        "Postfix",
                        "Exim"
                    ]
                },
                {
                    "skill": "Server Management",
                    "subskills": [
                        "cPanel",
                        "zPanel",
                        "Webmin",
                        "ISPConfig"
                    ]
                },
                {
                    "skill": "DNS",
                    "subskills": [
                        "Bind9",
                        "dnsmasq"
                    ]
                },
                {
                    "skill": "Router & NAS Systems",
                    "subskills": [
                        "pfSense",
                        "EdgeOS",
                        "freeNAS"
                    ]
                },
                {
                    "skill": "CloudFlare"
                },
                {
                    "skill": "Samba"
                },
                {
                    "skill": "OpenSSH"
                },
                {
                    "skill": "OpenVPN"
                },
                {
                    "skill": "rsync"
                },
                {
                    "skill": "wget"
                }
            ]
        }
    ],

    "code_samples": [
        {
            "name": "GitHub",
            "url": "https://github.com/nickistre"
        },
        {
            "name": "Bitbucket",
            "url": "https://bitbucket.org/nickistre"
        }
    ],

    "work_experiences": [
        {
            "company": "Aristotle's Alexander",
            "position": "Lead Software Developer",
            "location": "Lafayette, LA",
            "dates": {
                "start": "October 2014",
                "end": "Present"
            },
            "description": "Responsible for building highly complex software solutions using best-practices and patterns while acting as subject matter expert and team lead for software engineers across multiple large-scale IT projects.",
            "accomplishments": [
                "Continued development of an ExtJS and CouchDB application for a sometimes-online field ticketing and reporting system",
                "Created a library to allow for printable HTML reports in ExtJS",
                "Assisted in creating processes using vagrant and grunt for local development and testing"
            ]
        },
        {
            "company": "Comit Developers & ACA Ventures",
            "position": "Senior Engineer",
            "location": "Lafayette, LA",
            "dates": {
                "start": "July 2014",
                "end": "October 2014"
            },
            "description": "Building PHP cluster server systems, create deployment code and processes, maintaining legacy systems, assisting and instructing other developers on current projects, and reorganizing and documenting of new and existing servers.",
            "accomplishments": [
                "Built and maintained a Zend Server 7.0 Cluster system on Amazon AWS cloud services. Created scripts to help with deploying code to the cloud system and for scaling purposes",
                "Migrated company's and several clients' websites to a Wordpress multi-site system onto the cluster system",
                "Assisted with performance and other improvements to existing sites for SEO purposes, such as setting up SSL and using CloudFlare to improve response times"
            ]
        },
        {
            "company": "Teamwork Solutions Group",
            "position": "Vice President of Interactive",
            "location": "Lafayette, LA",
            "dates": {
                "start": "March 2009",
                "end": "July 2014"
            },
            "description": "Building systems for clients mainly using PHP, JavaScript, and Actionscript for web, desktop, and mobile applications.",
            "accomplishments": [
                "Built a webservice and tablet system for use in evaluating nursing students",
                "Completed a job-posting application site",
                "improved a custom-built ad-delivery system that allowed clients to submit video and image ads that ran on screens in various local businesses",
                "Programmed custom-built touchscreen headrests for interactive ad systems in taxis",
                "Pushed for the switch from Subversion to Mercurial as the company's version control system"
            ]
        },
        {
            "company": "Rader Solutions",
            "position": "Lead Web Developer",
            "location": "Lafayette, LA",
            "dates": {
                "start": "December 2006",
                "end"  : "December 2008"
            },
            "description": "Duties mainly involved maintaining and extending a custom-built PHP website that provided accounting, ordering, and invoicing service for a large construction supply company, which also included the administration of the PostgreSQL database and CentOS systems powering the site.",
            "accomplishments": [
                "Moved the codebase into a Subversion repository for better code maintenance",
                "Improved security and reusability of project parts",
                "Headed a team of five developers to expand the project",
                "Added a user authentication and security model using an LDAP connection to Windows 2003 Server Active Directory",
                "Optimized the data transfer code between the project and an accounting system running on an IBM AIX server",
                "Converted the project from PHP on a CentOS server with PostgresSQL to PHP running on a Windows Server with SQL Server 2005"
            ]
        },
        {
            "company": "Service Tool Company, LLC",
            "position": "System Analyst",
            "location": "New Iberia, LA",
            "dates": {
                "start": "May 2001",
                "end"  : "December 2006"
            },
            "description": "Administrating a Windows-based network for an office of 50 employees. This included maintaining, upgrading, and building software applications for use by internal users and to facilitate communications with customers and vendors, encouraging and implementing user and internet security, and building queries and reports to provide critical information to the executive and sales staff.",
            "accomplishments": [
                "Moved the company’s primary database storage from Access 2000 to SQL Server",
                "Migrated the primary accounting and sales processing software from Great Plains Account (DOS-based) to Great Plains Dynamics 6.0 (Windows-based)",
                "Developed an application that provided a way for internal processors to access faxes from remote sales staff in a paperless format",
                "Implemented and maintained an EDI system",
                "Utilized VMWare server to massively reduce the amount of time and money spent on physical servers for testing and deployment of various systems"
            ]
        }
    ],

    "education": [
        {
            "school": "University of Louisiana at Lafayette",
            "degree": "Bachelors of Science in Computer Science",
            "dates": {
                "start": "1997",
                "end"  : "2001"
            },
            "description": "Magna Cum Laude with a 3.85 GPA, Honors Society member, Inline Hockey Club President"
        }
    ],

    "awards": [
        {
            "title": "Grand Prize Winning Team",
            "issuer": "CajunCodeFest 3.0",
            "date":  "April 2014",
            "description": "The theme of the competition was \"Aging in Place\", and my team's winning solution was custom built hardware and software that would help elderly people live at home safely through the collection and communication of a person’s medical, social and environmental status. We had beat out 11 other teams (of up to 6 members) in the 28 hour competition to win the $10,000 prize. My main part in the project was to build a custom interfacing system using Arduino and radio receiving hardware and python running on an internet-connected computer to queue and transmit data from remote sensor units to a Joomla-based web application system."
        }
    ],

    "organizations": [
        {
            "position": "Organizer",
            "organization": "Acadiana Open Source Group",
            "dates": {
                "start": "May 2014",
                "end"  : "Present"
            }
        }
    ]
}
